## Plan Result (sbox_aria - Terraform Plan Apply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_eventhub.aria_topic[&#34;00&#34;]
  * azurerm_eventhub.aria_topic[&#34;02&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventhub.aria_topic["00"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "test-evh-joh-dl-sbox-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "test-evh-joh-dl-sbox-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"sbox_aria - Terraform Plan Apply","Vars":{}} -->